
<head>
    <link rel="stylesheet" href="index.css">
    <title>Ubademy - Gu&iacute;as</title>
</head>

<body>

    <div class="navbar">
        <div><img src="Ubademy_inverted.png" width="100px">></div>
        <a href="#backoffice-guide">Gu&iacute;a de Usuario - Back office</a>
        <a href="#app-guide">Gu&iacute;a de Usuario - Aplicaci&oacute;n</a>
    </div>

    <br>

    <div class="body">         
        <div id="backoffice-guide" style="padding-top:40px;">
            <h1 style="text-align: center;">
                Gu&iacute;a de c&oacute;mo utilizar el Back Office
            </h1>
            
            <p style="font-weight: bold; text-align: center; font-style: italic;" >
                Para poder ingresar al Back Office es necesario contar con una cuenta de administrador 
            </p>
            <p>
                Una vez ingresado, el administrador contar&aacute; con dos opciones para elegir: Usuarios, y Cursos. Ademas, estar&aacute; disponible una barra de navegaci&oacute;n
                en la parte superior de la pantalla con las mismas opciones que siempre estar&aacute;n disponibles.
            </p>
            <h3 >
                Usuarios
            </h3>
            <p>
                Dentro de esta secci&oacute;n se podr&aacute;n ver todos los datos correspondientes a los usuarios, sus estado de cuentas, datos personales, y una metrica global. 
                Esta seccion a su vez esta dividida en dos sub secciones.
            </p>
            <h4>Administraci&oacute;n de usuarios</h4>
            <p>
                En este apartado se listar&aacute;n todos los usuarios del sistema mostrando sus nombres y direcciones de correo electr&oacute;nico. Estos datos estar&aacute;n dispuestos 
                en una tabla paginada en la cual el administrador puede navegar con el paginador. Por otro lado, se contar&aacute; con los 
                siguentes filtros para facilitar la b&uacute;squeda: 
            
                <ul>
                    <li>Username</li>
                    <li>Email</li>
                </ul>
                Adem&aacute;s el administrador podr&aacute; bloquear o desbloquear a los usuarios provocando que estos no puedan iniciar sesi&oacute;n en la aplicaci&oacute;n. 
                Por &uacute;ltimo, se contar&aacute; con la posibilidad de visualizar los perfiles de los usuarios.
            </p>
            <div align="center" style="margin-top:35px; margin-bottom:35px;">
                <img src="./backoffice-screenshots/back_usuarios.png">
            </div>
            <h5>Perfiles de Usuarios</h5>
              Dentro de este men&uacute; el administrador podr&aacute; visualizar los datos personales del usuario.
              <ul>
                <li>Nombre de Usuario</li>
                <li>Email</li>
                <li>Identificador &Uacute;nico</li>
                <li>Nivel de Suscripci&oacute;n</li>
                <li>Ubicaci&oacute;n</li>
                <li>Tipo de Usuario</li>
            </ul>
            <div align="center" style="margin-top:35px; margin-bottom:35px;">
                <img src="./backoffice-screenshots/back_usuarios_detalle.png">
            </div>
            Tambien se contar&aacute; con una tabla en la cu&aacute;l se podran observar todos los cursos en los cuales el usuario est&aacute; inscripto como estudiante.
            <div align="center" style="margin-top:35px; margin-bottom:35px;">
                <img src="./backoffice-screenshots/back_usuarios_detalle_cursos.png">
            </div>
            <h4>M&eacute;tricas de Usuarios</h4>
                <p>
                    Dentro de este apartado es posible ver distintas m&eacute;tricas en funci&oacute;n del tiempo. Algunas de estas metricas son: 
                    Tipos de login realizados, nuevos registros, bloqueos a usuarios, y cantidad de veces que se recuperaron las contrase&ntilde;as
                </p>
            
            <h3>Cursos</h3>

            En este apartado se listar&aacute;n todos los cursos del sistema mostrando sus nombres, direcciones de correo electr&oacute;nico de sus due&ntilde;os, 
            descripciones de los cursos, niveles de suscripci&oacute;n, y ubicaci&oacute;n geogr&aacute;fica.
             Estos datos estar&aacute;n dispuestos en una tabla paginada en la cual el administrador puede navegar con el paginador. 
             Por otro lado, se contar&aacute; con los siguentes filtros para facilitar la b&uacute;squeda de cursos: 
            <ul>
                <li>Nombre de curso</li>
                <li>Descripci&oacute;n</li>
                <li>Nivel de suscripci&oacute;n</li>
                <li>Ubicaci&oacute;n geogr&aacute;fica</li>
            </ul>
            <div align="center" style="margin-top:35px; margin-bottom:35px;">
                <img src="./backoffice-screenshots/back_inf_cursos0.png">
            </div>
            <p>Adem&aacute;s el administrador podr&aacute; acceder a los cursos para ver los siguientes datos:</p>

              <ul>
                <li>Nombre del curso</li>
                <li>Nivel de suscripci&oacute;n</li>
                <li>Identificador &Uacute;nico del curso</li>
                <li>Identificador &Uacute;nico del due&ntilde;o del curso</li>
                <li>Nivel de Suscripci&oacute;n</li>
                <li>Ubicaci&oacute;n</li>
                <li>Hashtags del curso</li>
            </ul>
            <div align="center" style="margin-top:35px; margin-bottom:35px;">
                <img src="./backoffice-screenshots/back_inf_cursos.png">
            </div>
        </div>
        
        <div id="divider-guias"></div>

        <div id="app-guide" style="padding-top:40px;">
            <h1 style="text-align:center;">
                Gu&iacute;a de c&oacute;mo utilizar la Aplicaci&oacute;n
            </h1>

            <h3>
                Introducci&oacute;n
            </h3>
            <p>
                Dentro de la aplicaci&oacute;n el usuario podr&aacute; desenvolverse como alumno, como creador de contenido, y como colaborador simult&aacute;neamente sin tener que
                cambiar de usuarios, ni de definir su rol con el cu&aacute;l querr&aacute; manejarse. La aplicaci&oacute;n internamente sabr&aacute; manejar cada caso de cada curso en particular
                en el cual el usuario se encuentre involucrado.<br><br>
                Adem&aacute;s, se poseen tambi&eacute;n un listado de cursos con calificaciones para que el usuario sea capaz de elegir de entre los que le sean mostrados, cu&aacute;l le
                es de su agrado, y podr&aacute; inscribirse en el mismo siempre y cuando su inscripci&oacute;n se lo permita.<br><br>
                En la aplicaci&oacute;n, tambi&eacute;n habr&aacute; un sistema de usuarios que podr&aacute; verse explicado en las siguientes secciones para los registros y logins de usuarios tanto
                con email y contrase&ntilde;a, como con un login federado con una cuenta de Google.
            </p>

            <h3>
                Registro
            </h3>
            <p>
                Para registrar un usuario en la pantalla inicial de la aplicaci&oacute;n se debe tocar el bot&oacute;n que dice "Don't have an account? Sign Up" para de esta forma poder
                proceder a la secci&oacute;n de registro.<br>
                Una vez en la secci&oacute;n de registro, el usuario puede proceder a crearse una cuenta completando los siguientes campos:
                <ul>
                    <li>
                        Username: Nombre de usuario que ser&aacute; visualizado en la aplicaci&oacute;n. Unicamente permite caracteres alfab&eacute;ticos
                    </li>
                    <li>
                        Email: Ser&aacute; el identificador &uacute;nico del usuario dentro de la aplicaci&oacute;n y no podr&aacute; ser modificado. Debe ser un email v&aacute;lido.
                    </li>
                    <li>
                        Password y Password Confirmation: Se deber&aacute;n completar tanto el campo password como el password confirmation, y deben coincidir. 
                        La contrase&ntilde;a debe tener una longitud m&iacute;nima de 8 caracteres.
                    </li>
                </ul>
                
                Al finalizar de generar el contenido del registro, entonces deber&aacute; pulsarse el bot&oacute;n de Sign Up para finalizar el registro. En caso de errores se mostrar&aacute;
                descriptivamente el fallo por el cu&aacute;l no puede realizarse el registro.
            </p>
            <div align="center" style="margin-top:35px; margin-bottom:35px;">
                <img src="./app-screenshots/Signup.png">
            </div>
            

            <h3>
                Login
            </h3>
            <p>
                Para generar un login correcto deber&aacute;n introducirse las credenciales del ususario, tanto el email como su contrase&ntilde;a. En caso de que estas se validen y
                sean correctas para un usuario registrado, entonces la aplicaci&oacute;n admitir&aacute; el ingreso, generando una sesi&oacute;n, redirigiendo al usuario a la p&aacute;gina
                de inicio.<br><br>
                <span style="font-weight:bold;">Aclaraci&oacute;n: </span>
                <span style="font-style: italic;">En caso de que el usuario se encuentre bloqueado no podr&aacute; realizar un login en la aplicaci&oacute;n y deber&aacute; comunicarse con un administrador.</span>
            </p>

            <h4>
                Login Federado
            </h4>
            <p>
                Para el login federado en la misma secci&oacute;n que el login, existe el bot&oacute;n que dice "Sign in with google", que al presionarlo nos permitir&aacute; tanto
                generar una cuenta nueva con un usuario de google que seleccionemos, como tambi&eacute;n acceder con una cuenta ya generada. Si es la primera vez que se inicia
                sesi&oacute;n en la aplicaci&oacute;n, esta autom&aacute;ticamente generar&aacute; los procesos necesarios para la creaci&oacute;n de la cuenta.
            </p>

            <div align="center" style="margin-top:35px; margin-bottom:35px;">
                <img src="./app-screenshots/Login.png">
            </div>



            <h3>
                Inscribirme a un curso
            </h3>
            <p>
                Al ingresar a la visualizaci&oacute;n de un curso, el mismo posee un boton de "Enroll to course" que podr&aacute; ser utilizado para inscribirnos al curso
                en cuesti&oacute;n. El curso posee un nivel de subscripci&oacute;n propio que puede visualizarse arriba a la derecha, y para poder anotarnos en el mismo, nuestro
                nivel de suscripci&oacute;n propio debe ser igual o mejor que el nivel requerido por el curso. <br><br>El orden de suscripciones el siguiente:
                <ol>
                    <li>Free</li>
                    <li>Standard</li>
                    <li>Premium</li>
                </ol>
            </p>
            <div align="center" style="margin-top:35px; margin-bottom:35px;">
                <img src="./app-screenshots/VisuCurso.png">
            </div>

            <h3>
                Visualizar multimedia de un curso
            </h3>
            <h1>
                AUN SIN FINALIZAR
            </h1>

            <h3>
                Visualizar mi perfil
            </h3>
            <p>
                Para visualizar nuestro perfil, podemos acceder desde la barra de navegaci&oacute;n lateral al mismo, en la secci&oacute;n "My Profile", que nos permitir&aacute;
                visualizar los datos que pueden verse en las imagenes, as&iacute; tambi&eacute;n como acceder a nuestros cursos por fuera de la barra de navegaci&oacute;n lateral
                que tambi&eacute;n lo permite.
            </p>
            <div align="center" style="margin-top:35px; margin-bottom:35px;">
                <img src="./app-screenshots/Profile.png">
            </div>

            <h4>
                Editar mi perfil
            </h4>
            <p>
                Desde la secci&oacute;n "My Profile", en el l&aacute;piz que se encuentra en la secci&oacute;n superior derecha, podemos realizar una edici&oacute;n de perfil,
                que nos permite modificar nuestro nombre de usuario.
            </p>
            
            <h4>
                Cambiar mi contrase&ntilde;a
            </h4>
            <p>
                Tambi&eacute;n en la misma secci&oacute;n de editar perfil, podemos encontrarnos con la secci&oacute;n de cambiar de contrase&ntilde;a, siendo estos dos formularios
                por separado que nos permiten tratar ambos casos por separado.
            </p>
            <div align="center" style="margin-top:35px; margin-bottom:35px;">
                <img src="./app-screenshots/EditProfile.png">
            </div>

            <h3>
                Rendir un ex&aacute;men en un curso
            </h3>
            <h1>
                AUN SIN FINALIZAR
            </h1>
        </div>
    </div>

</body>